doc/Примеры/импорт платежа запрос.xml

<SOAP-ENV:Envelope 
xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" 

xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
   <SOAP-ENV:Body wsu:Id="body">
      <n1:UnifoTransferMsg xsi:schemaLocation="http://roskazna.ru/SmevUnifoService/ MethodMsg.xsd" xmlns:ds="http://www.w3.org/2000/09/xmldsig#" xmlns:n1="http://roskazna.ru/SmevUnifoService/" xmlns:pirq="http://roskazna.ru/xsd/PGU_ImportRequest" xmlns:smev="http://smev.gosuslugi.ru/rev111111" xmlns:unifo="http://rosrazna.ru/xsd/SmevUnifoService" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
         <smev:Message>
            <smev:Sender>
               <smev:Code>RKZN35001</smev:Code>
               <smev:Name>Казначейство России</smev:Name>
            </smev:Sender>
            <smev:Recipient>
               <smev:Code>RKZN35001</smev:Code>
               <smev:Name>Казначейство России</smev:Name>
            </smev:Recipient>
            <smev:TypeCode>GFNC</smev:TypeCode>
            <smev:Status>REQUEST</smev:Status>
            <smev:Date>2001-12-17T09:30:48.0Z</smev:Date>
            <smev:ExchangeType>6</smev:ExchangeType>
         </smev:Message>
         <smev:MessageData>
            <smev:AppData>
               <unifo:ImportData>
                  <pirq:ImportRequest>
                     <PostBlock>
                        <ID>54545</ID>
                        <TimeStamp>2012-07-25T09:30:47.0Z</TimeStamp>
                        <SenderIdentifier>044525225</SenderIdentifier>
                     </PostBlock>
                     <FinalPayment>
                       <SupplierBillID>18810ЗA63КК560868ZZ6</SupplierBillID>
                        <Narrative>Оплата Штрафа за административное правонарушение</Narrative>
                        <Amount>80000</Amount>
                        <PaymentDate>2012-12-06</PaymentDate>
                        <BudgetIndex>
                           <Status>0</Status>
                           <PaymentType>0</PaymentType>
                           <Purpose>0</Purpose>
                           <TaxPeriod>0</TaxPeriod>
                           <TaxDocNumber>0</TaxDocNumber>
                           <TaxDocDate>0</TaxDocDate>
                        </BudgetIndex>
                        <PaymentIdentificationData>
                           <Bank>
                              <Name>ГРКЦ ГУ банка России по Самарской области г.Самара</Name>
                              <BIK>043601001</BIK>
                           </Bank>
                           <SystemIdentifier>BBDF8204867833</SystemIdentifier>
                        </PaymentIdentificationData>
                        <ChangeStatus>1</ChangeStatus>
                        <payeeINN>6317021970</payeeINN>
                        <payeeKPP>631601001</payeeKPP>
                        <KBK>18811630000010000140</KBK>
                        <OKATO>36401000000</OKATO>
                     </FinalPayment>
                  </pirq:ImportRequest>
               </unifo:ImportData>
            </smev:AppData>
         </smev:MessageData>
      </n1:UnifoTransferMsg>
   </SOAP-ENV:Body>
</SOAP-ENV:Envelope>